[
    {
        "title":"Sheperd Ranch",
        "imageName":"sheperdRanch.jpg",
        "description":"<p>At Sheperd Ranch, designed to help damaged youth and animals, Will Baxter, is given a second chance when he meets a horse, a dog, and friends of all ages and backgrounds. Included in this group are Crow Indians and a hermit with amysterious past who lives alone at a cabin in the mountains. When the ranch caretakers' daughter gets kidnapped at the yearly Crow Fair, this mismatched group joins forces to find her and solve a mystery from the past. </p><p>Sheperd Ranch is a fictional adventure book of 63,000 words aimed at young adults of ALL ages. The plot revolves around a variety of interesting characters beginning in Chicago then moving tot he Crow Indian Reservation in Montana. This story begins with the reader feeling empathy toward the main character as he leaves the city for a ranch designed to help wayward young men and boys. There he meets animals, boys of various backgrounds, Crow Indians, and a mysterious hermit. The story is filled with adventure, mystery, family secrets, and young love. The boys are exposed to ranch life as well as factual Crow Indian history and culture. The reader will travel along with Will, Zach, horse Red and dog Charlie on their Montana adventure.</p>"
    },
    {
        "title":"The Diary",
        "imageName":"diary.jpg",
        "description":"<p>When several skeletons are found in the basement of a house being demolished for urban renewal, young reporter Susan Mahoney meets stern no-nonsense officer Detective Alexander Johnson. He tells Susan the story is not at the crime scene, but what is the story behind the crime? As Susan searches for the answer to that question she discovers Lydia Roberts-Schultz, 1930’s woman. <em>The Diary</em> is the story of these two women who lived 90 years apart, but share many similarities while struggling to make their way in the world. As young women they ventured out into the world with dreams of having an education and career to fulfill their desires, but falling in love was not part of their plans. Even though they lived two generations apart they shared the burden women have always shared of work, love, and raising a family. This story is fictional, but represents a VERY real part of life for women during the early twentieth century and today as both fight for survival in a world where they struggle for equality on a level with men. While traveling with Susan and Lydia on their journeys as they struggle to fulfill their dreams, you may feel empathy for their struggles as you reflect on your own dreams and ultimate choices.</p>"
    },
    {
        "title":"Exploring the Career Development Experiences of American Indian Educators Becoming K-12 School Teachers",
        "imageName":"dissertation.png",
        "description":"<p>For my doctoral dissertation I chose to give voice to the people who welcomed the pilgrims to this land and helped them survive the first year so they could grow and flourish. They have given themselves the title of First People because all who came to America, a land they held dear for many centuries prior to 1492, were immigrants. Over the years the American Indians were forced to abandon much of their traditions, way of living, and livelihood but not their beliefs held deeply inside their minds and souls. I chose to interview American Indians who’s career of being educators enables them to give back to their tribes by teaching children the heritage of what it means to be American Indian. The long journey I took doing the research, visiting American Indian colleges, and interviewing tribal educators took five years. I enjoyed the journey and felt a strong empathy toward these proud people as I sat in conference with a group of Ho Chunk leaders who enlightened me about what it means to be American Indian so my story would be authentic. I also shed tears of joy and sorrow as I conducted fifteen interviews with teachers of various tribes who currently teach in tribal schools on or near Wisconsin reservations. My goal was to honor their stories and give them voice. I invite you to read about the history and present day lives of the American Indians and feel as much empathy and respect for them as I do. Click the button below to view my published dissertation archived at St. Mary’s University of Minnesota.</p>"
    }
]
